owhinata/stm32f746g-disco/port/camera/camera.c
int camera_set_effect(enum camera_effect effect)
{
	int rc;

	if ((unsigned)effect > CAM_FX_GREEN)
		return CAM_ERR_PARAM;
	rc = op_lock();
	if (rc != 0)
		return rc;
	settings.effect = (uint8_t)effect;
	settings_dirty = 1;
	rc = apply_if_live_locked();
	op_unlock();
	return rc;
}

int camera_set_flip(enum camera_flip flip)
{
	int rc;

	if ((unsigned)flip > CAM_FLIP_BOTH)
		return CAM_ERR_PARAM;
	rc = op_lock();
	if (rc != 0)
		return rc;
	settings.flip = (uint8_t)flip;
	settings_dirty = 1;
	rc = apply_if_live_locked();
	op_unlock();
	return rc;
}

int camera_set_zoom(int factor)
{
	int rc;

	if (factor != 1 && factor != 2 && factor != 4 && factor != 8)
		return CAM_ERR_PARAM;
	rc = op_lock();
	if (rc != 0)
		return rc;
	settings.zoom = (uint8_t)factor;
	settings_dirty = 1;
	rc = apply_if_live_locked();
	op_unlock();
	return rc;
}

int camera_set_night(int on)
{
	int rc = op_lock();

	if (rc != 0)
		return rc;
	settings.night = on ? 1u : 0u;
	settings_dirty = 1;
	rc = apply_if_live_locked();
	op_unlock();
	return rc;
}

int camera_set_defaults(void)
{
	int rc = op_lock();

	if (rc != 0)
		return rc;
	settings.brightness = 0;
	settings.contrast   = 0;
	settings.saturation = 0;
	settings.hue        = 0;
	settings.awb        = CAM_AWB_AUTO;
	settings.effect     = CAM_FX_NONE;
	settings.flip       = CAM_FLIP_NONE;
	settings.zoom       = 1;
	settings.night      = 0;
	settings_dirty      = 1;
	rc = apply_if_live_locked();
	op_unlock();
	return rc;
}

/* ---- streaming producer (issue #46) -------------------------------------- */

/* frame_os: the pipeline core's injected mutual exclusion (a TX_MUTEX, distinct
   from the driver cam_lock).  The core is only ever entered from the producer
   thread (and start/stats under cam_lock), never from an ISR. */
static void cam_pipe_os_lock(void *ctx)
{
	(void)ctx;
	(void)tx_mutex_get(&cam_pipe_lock, TX_WAIT_FOREVER);
}

static void cam_pipe_os_unlock(void *ctx)
{
	(void)ctx;
	(void)tx_mutex_put(&cam_pipe_lock);
}

static const struct frame_os cam_pipe_os = {
	NULL, cam_pipe_os_lock, cam_pipe_os_unlock
};

/* Counting sink: the display-independent FPS / throughput consumer.  DROP
   policy and it returns each frame's pin immediately (no holding), so the
   producer is never blocked -- exactly the #46 measurement target.  The core
   keeps delivered/dropped. */
static int cam_stat_open(void *ctx, enum frame_format fmt, uint16_t w, uint16_t h)
{
	(void)ctx;
	if (fmt != FRAME_FMT_RGB565 || w != CAMERA_FRAME_WIDTH ||
	    h != CAMERA_FRAME_HEIGHT)
		return -1;
	return 0;
}

static int cam_stat_consume(void *ctx, const struct frame_desc *f)
{
	(void)ctx;
	frame_pipeline_put(&cam_pipe, &cam_stat_sink, f);
	return 0;
}

/* DMA transfer-complete (ISR context): one ring buffer just filled.  Only wakes
   the producer; it touches no ring / pipeline / CT state (the #47 ISR rule). */
static void cam_stream_dma_cb(DMA_HandleTypeDef *h)
{
	(void)h;
	if (!cam_stream_active)
		return;
	(void)tx_semaphore_put(&cam_stream_sem);
}

/* DMA transport error (TE/DME/FE): terminal, like a DCMI overrun. */
static void cam_stream_dma_err_cb(DMA_HandleTypeDef *h)
{
	(void)h;
	if (!cam_stream_active)
		return;
	cam_stream_err = 1;
	(void)tx_semaphore_put(&cam_stream_sem);
}

static void drain_stream_sem(void)
{
	while (tx_semaphore_get(&cam_stream_sem, TX_NO_WAIT) == TX_SUCCESS)
		;
	/* A start kick that landed while the producer was already active lingers on
	   cam_start_sem; clear it so a later idle wait blocks instead of spinning
	   once. */
	while (tx_semaphore_get(&cam_start_sem, TX_NO_WAIT) == TX_SUCCESS)
		;
}

static uint32_t cam_elapsed_ms;   /* frozen at teardown for post-stop `stats` */

/* Stop the stream and restore a clean snapshot-ready DCMI/DMA.  Producer-thread
   only (single owner): start / stop / auto-stop / OVR all converge here, so the
   HW teardown never races the producer's repoint.  Short cam_lock for the state
   transition (serialises with start / stats). */
static void cam_stream_teardown(void)
{
	(void)tx_mutex_get(&cam_lock, TX_WAIT_FOREVER);
	if (cam_stream_active) {
		cam_stream_active = 0;
		cam_elapsed_ms = HAL_GetTick() - cam_start_tick;
		(void)HAL_DCMI_Stop(&hdcmi);          /* aborts the DMA internally */
		frame_pipeline_detach(&cam_pipe, &cam_stat_sink);
		drain_stream_sem();
		/* HAL_DCMI_Stop leaves CR.DBM set on the stream; re-init the DMA so the
		   next snapshot's HAL_DCMI_Start_DMA runs a plain single transfer. */
		(void)HAL_DMA_DeInit(&hdma_dcmi);
		hdma_dcmi.Init.Mode = DMA_NORMAL;
		(void)HAL_DMA_Init(&hdma_dcmi);
		__HAL_LINKDMA(&hdcmi, DMA_Handle, hdma_dcmi);
		LOG_INF("stream stop (%lu frames, ovr dcmi=%lu ring=%lu)",
		        (unsigned long)cam_pipe.stats.published,
		        (unsigned long)cam_stream_ovr, (unsigned long)cam_ring_ovr);
	}
	(void)tx_mutex_put(&cam_lock);
}

/* Service one completed frame: find the completed buffer via CT, secure a free
   slot, repoint the completed M-register away, THEN publish.  This ordering
   keeps a published slot off the live DMA target list, so a sink never reads a
   buffer the DMA is about to overwrite (tear-free).  No free slot -> drop. */
static void cam_stream_service(int had_sem)
{
	uint32_t ct, seen, extra = 0;
	struct frame_desc *done, *freed;
	int published = 0;

	/* Stop conditions (also handles the bounded-timeout wake with no frame). */
	if (cam_stop_req || cam_stream_err ||
	    (cam_target_frames && cam_pipe.stats.published >= cam_target_frames) ||
	    (cam_target_secs &&
	     (HAL_GetTick() - cam_start_tick) >= cam_target_secs * 1000u)) {
		cam_stream_teardown();
		return;
	}

	/* Completions observed this pass (one semaphore each): the wake plus any
	   drained extras.  We publish at most the most-recent buffer flip; every
	   other observed completion was overwritten -> ring overrun. */
	while (tx_semaphore_get(&cam_stream_sem, TX_NO_WAIT) == TX_SUCCESS)
		extra++;
	seen = (had_sem ? 1u : 0u) + extra;

	ct = (DMA2_Stream1->CR & DMA_SxCR_CT) ? 1u : 0u;
	if (ct != cam_last_ct) {
		cam_last_ct = ct;
		/* CT==1 -> M0 just completed; CT==0 -> M1 just completed (the HAL
		   HAL_DMA_IRQHandler DBM dispatch mirrors this). */
		done = ct ? cam_m0 : cam_m1;
		freed = frame_pipeline_acquire(&cam_pipe);
		if (freed != NULL) {
			if (ct) {
				(void)HAL_DMAEx_ChangeMemory(&hdma_dcmi,
				        (uint32_t)freed->data, MEMORY0);
				cam_m0 = freed;
			} else {
				(void)HAL_DMAEx_ChangeMemory(&hdma_dcmi,
				        (uint32_t)freed->data, MEMORY1);
				cam_m1 = freed;
			}
			frame_pipeline_publish(&cam_pipe, done, CAMERA_FRAME_BYTES,
			                       FRAME_FMT_RGB565, CAMERA_FRAME_WIDTH,
			                       CAMERA_FRAME_HEIGHT,
			                       CAMERA_FRAME_WIDTH * 2u);
			published = 1;
		}
		/* freed == NULL: no free slot, drop (do not publish); the M-reg keeps
		   pointing at `done`, so the DMA simply refills it next cycle. */
	}
	if (seen > (uint32_t)published)
		cam_ring_ovr += seen - (uint32_t)published;
}

